# -*- coding: utf-8 -*-

from __future__ import absolute_import, unicode_literals

from collections import defaultdict
from heapq import nlargest
from string import punctuation

from pythainlp.corpus.common import thai_stopwords
from pythainlp.tokenize import sent_tokenize, word_tokenize


class FrequencySummarizer:
    def __init__(self, min_cut=0.1, max_cut=0.9):
        self.__min_cut = min_cut
        self.__max_cut = max_cut
        self.__stopwords = set(thai_stopwords())
        # list(punctuation)

    def __compute_frequencies(self, word_tokenized_sents):
        word_freqs = defaultdict(int)
        for sent in word_tokenized_sents:
            for word in sent:
                if word not in self.__stopwords:
                    word_freqs[word] += 1

        max_freq = float(max(word_freqs.values()))
        for w in list(word_freqs):
            word_freqs[w] = word_freqs[w] / max_freq
            if word_freqs[w] >= self.__max_cut or word_freqs[w] <= self.__min_cut:
                del word_freqs[w]

        return word_freqs

    def __rank(self, ranking, n):
        return nlargest(n, ranking, key=ranking.get)

    def summarize(self, text, n, tokenizer):
        sents = sent_tokenize(text)
        word_tokenized_sents = [word_tokenize(sent, None, tokenizer) for sent in sents]
        self.__freq = self.__compute_frequencies(word_tokenized_sents)
        ranking = defaultdict(int)

        for i, sent in enumerate(word_tokenized_sents):
            for w in sent:
                if w in self.__freq:
                    ranking[i] += self.__freq[w]
        summaries_idx = self.__rank(ranking, n)

        return [sents[j] for j in summaries_idx]

    def summarize_text(text, n, engine="frequency", tokenizer="newmm"):
        """
        Thai text summarization
        :param str text: text to be summarized
        :param int n: number of sentences to be included in the summary
        :param str engine: text summarization engine
        :param str tokenizer: word tokenizer
        :return List[str] summary: list of selected sentences
        """
        sents = []

        if engine == "frequency":
            sents = FrequencySummarizer().summarize(text, n, tokenizer)
        else:  # if engine not found, return first n sentences
            sents = sent_tokenize(text)[:n]

        return sents


text = "หลังจากกรมอุตุนิยมวิทยาญี่ปุ่น หรือเจเอ็มเอ ออกประกาศเตือนภัยพายุฝนรุนแรงครั้งประวัติการณ์ จากฤทธิ์ของมหาไต้ฝุ่น “ฮากิบิส” ที่เคลื่อนตัวขึ้นฝั่งภาคกลางในพื้นที่จังหวัดชิซุโอกะและคานางาวะทางตะวันตกของกรุงโตเกียว โดยแนะนำประชาชนในพื้นที่จังหวัดที่อยู่ในเส้นทางของไต้ฝุ่น ทั้งกรุงโตเกียว ชิซุโอกะ คานางาวะ ไซตามะ ยามานาชิ และนางาโนะ อพยพไปยังอาคารที่มีความปลอดภัย หรือหลบภัยขึ้นชั้น 2 ของบ้าน ขณะเดียวกัน สำนักงานจังหวัดคานางาวะ ทางตะวันตกของกรุงโตเกียว ได้สั่งระบายน้ำออกจากเขื่อนชิโรยามะ ในเมืองซากามิฮาระ ตามมาตรการลดระดับน้ำฉุกเฉิน ส่งผลให้ระดับน้ำของแม่น้ำซากามิและแม่น้ำสายอื่นที่เชื่อมต่อกัน มีระดับสูงขึ้นไปอีก เพิ่มความเสี่ยงต่อการเกิดเหตุน้ำท่วมฉับพลันหรือดินถล่มในพื้นที่ 8 อำเภอของจังหวัดคานางาวะเมื่อวันที่ 12 ต.ค. สำนักข่าวต่างประเทศรายงานความคืบหน้ามหาไต้ฝุ่น “ฮากิบิส” ที่เริ่มพัดขึ้นฝั่งในช่วงเช้า โดยที่จังหวัดชิบะ ทางตะวันออกของกรุงโตเกียว สำนักข่าวเจแปนไทม์ของญี่ปุ่นรายงานว่า มีผู้เสียชีวิต 1 คน เป็นชายวัย 49 ปี จากอุบัติเหตุรถยนต์พลิกคว่ำ และมีผู้บาดเจ็บอีก 4 คน จากพายุทอร์นาโดที่ก่อตัวในบริเวณ แต่อาการไม่สาหัส ขณะที่บ้านเรือนอย่างน้อย 9,200 หลังไม่มีไฟฟ้าใช้ตั้งแต่ช่วงเช้าวันที่ 12 ต.ค. ท่ามกลางความกังวลว่าจะเกิดความเสียหายเพิ่มขึ้น เนื่องจากพื้นที่จังหวัดชิบะยังคงบอบช้ำจากฤทธิ์ของไต้ฝุ่นฟ้าใส เมื่อเดือน ก.ย.ที่ผ่านมา มีรายงานด้วยว่าบ้านเรือนในหลายพื้นที่ถูกแรงลมพัดหลังคาหลุดปลิว เสาไฟฟ้าล้ม ต้นไม้หักโค่น รถยนต์ที่จอดไว้กลางแจ้งถูกกระแสลมพายุพัดจนพลิกคว่ำต่อมากรมอุตุนิยมวิทยารายงานว่า ไต้ฝุ่นฮากิบิสได้อ่อนกำลังลงอย่างต่อเนื่องจากที่เคยมีระดับความรุนแรงกว่า 250 กิโลเมตรต่อชั่วโมง ได้ลดเหลือความเร็วเฉลี่ยประมาณ 162 กิโลเมตรต่อชั่วโมง แต่ยังคงเส้นทางเคลื่อนตัวไปทางทิศตะวันออกเฉียงเหนือ พัดผ่านจังหวัดชิซุโอกะ คานางาวะ ไซตามะ และเขตกรุงโตเกียว ก่อนผ่านไปยังจังหวัดชิบะ อิบารากิและฟูกูชิมะ ออกสู่มหาสมุทรแปซิฟิก กระนั้นไต้ฝุ่นจะทำให้เกิดฝนตกหนักครอบคลุมพื้นที่ชายฝั่งตะวันออกของญี่ปุ่น รวมถึงบางพื้นที่ของจังหวัดฮอกไกโดทั้งนี้ สำนักข่าวต่างประเทศรายงานด้วยว่า ไต้ฝุ่นฮากิบิสส่งผลให้ทางการญี่ปุ่นออกคำแนะนำอพยพประชาชนกว่า 3.2 ล้านคน ขณะที่การให้บริการรถไฟและรถไฟความเร็วสูงชินคันเซนได้ถูกระงับตลอดวัน เช่นเดียวกับสายการบินต่างๆที่หยุดให้บริการกว่า 1,600 เที่ยวบิน สวนสนุกโตเกียวดิสนีย์แลนด์ และสวนน้ำโตเกียวดิสนีย์ซี ได้ปิดบริการเต็มวันเป็นครั้งแรก นอกจากนี้ ยังมีรายงานเหตุแผ่นดินไหวรุนแรง 5.7 แมกนิจูด ในช่วงเย็นวันที่ 12 ต.ค. จุด ศูนย์กลางอยู่ห่างจากชายฝั่งทางใต้ของจังหวัดชิบะ ไปประมาณ 57 กม. เบื้องต้นยังไม่มีรายงานผู้ได้รับบาดเจ็บ หรือเสียชีวิตจากเหตุแผ่นดินไหวสำหรับการดูแลคนไทยในพื้นที่เสี่ยงได้รับผลกระทบจากพายุไต้ฝุ่นลูกนี้ กระทรวงการต่างประเทศของไทยระบุว่า ได้รับรายงานจากสถานเอกอัครราชทูต ณ กรุงโตเกียวว่า เมื่อเวลา 09.50 น. วันที่ 12 ต.ค.ตามเวลาท้องถิ่น ศูนย์กลางของพายุยังไม่เข้าฝั่งญี่ปุ่น แต่ขอบพายุมาถึงแล้ว ทำให้เกิดฝนตกหนัก โดยพื้นที่ที่หนักที่สุดคือ กรุงโตเกียวและโทไก (คือ แถบอิซึ) นอกจากนั้น มีรายงานการเกิดไฟดับใน 4.8 แสนครัวเรือน และเกิดพายุหมุนทำให้บ้านเรือนพังในเขต จ.ชิบะด้วยในชั้นนี้ มีประกาศให้มีการเคลื่อนย้ายผู้คนออกจากในบางพื้นที่แถบชานเมืองโตเกียว เช่น Hachioji และ Sagamihara แล้ว ส่วนพื้นที่อื่นๆ ในโตเกียว รัฐบาลญี่ปุ่นขอให้ประชาชนไม่ออกไปนอกอาคาร และเตรียมพร้อมสำหรับการอพยพคนชรา คนพิการ หรือเด็ก หากมีกรณีฉุกเฉิน ในการนี้ ขอให้คนไทยในคันไซ คันโต และโทไก ติดตามสถานการณ์ประกาศของทางการท้องถิ่น ตรวจสอบสถานที่ที่เป็นจุดพักพิงชั่วคราวใกล้บ้านตน และควรอยู่ในอาคาร ไม่ออกไปถ่ายภาพพายุ หรือบริเวณท่าน้ำ หรือออกไปท่องเที่ยวโดยเด็ดขาด อย่างไรก็ตาม ยังไม่มีรายงานว่าคนไทยได้รับผลกระทบใดๆ ทั้งนี้สามารถติดต่อฝ่ายกงสุล สอท. ณ กรุงโตเกียว (+81) 03-5789-2449 Hotline กรมการกงสุล 0-2572-8442 ทั้งนี้ สถานเอกอัครราชทูตไทย ณ กรุง โตเกียว ยังมีคำแนะนำแก่นักท่องเที่ยวไทยถึงบริการสัญญาณไวไฟฟรีของทางการญี่ปุ่น ในช่วงที่มีสถานการณ์ฉุกเฉิน 00000JAPAN ว่าเป็นสัญญาณแบบเปิด อาจมีแฮกเกอร์ผู้ฉวยโอกาส ควรหลีกเลี่ยงการใช้ไวไฟนี้ทำธุรกรรมทางการเงินด้านนายประภัตร โพธสุธน รมช.เกษตรและสหกรณ์ เปิดเผยว่า ขณะนี้ตนและคณะเดินทางเยือนประเทศญี่ปุ่น เพื่อหารือความร่วมมือด้านเกษตรและตรวจเยี่ยมตลาดปลาโทโยสุ ที่กรุงโตเกียว ประเทศญี่ปุ่น กรมอุตุนิยมวิทยาญี่ปุ่นประกาศแจ้งเตือนซุปเปอร์ไต้ฝุ่นฮากิบิส ที่คาดการณ์ความรุนแรงของพายุจะเทียบเท่าเฮอริเคนระดับ 5 ที่มีความรุนแรงที่สุดในประวัติศาสตร์โลกนั้น ขอให้คนไทยที่อยู่ในประเทศ ญี่ปุ่นเฝ้าระวังติดตามสถานการณ์ตามประกาศของรัฐบาลญี่ปุ่นอย่างใกล้ชิด เพื่อความปลอดภัย ในส่วนของตนและคณะ ทางการญี่ปุ่นส่งเจ้าหน้าที่คอยดูแลภายในโรงแรมที่พักซึ่งปลอดภัยดี และขอขอบคุณที่แสดงความห่วงใยตนและคณะอยู่ตลอดเวลาเป็นอย่างมาก อย่างไรก็ตาม คาดว่าจะสามารถเดินทางกลับประเทศไทยได้ในวันจันทร์ที่ 14 ต.ค.นี้ขณะที่บริษัท การบินไทย จำกัด (มหาชน) ได้แจ้งการปรับแผนของสายการบินไทยที่ไปญี่ปุ่น เพื่อเลี่ยงผลกระทบจากพายุไต้ฝุ่นฮากิบิส 4 จุดบิน ได้แก่ โอซากา นาโกยา และโตเกียว (นาริตะและฮาเนดะ) โดยปรับเปลี่ยนเลื่อนเวลาทำการบินจากตารางการบินปกติของ 6 เที่ยวบินจากกรุงเทพฯ ไปยังโตเกียว (นาริตะ) และเที่ยวบินโตเกียว-กรุงเทพฯ ของวันที่ 12-13 ต.ค.2562 ผู้โดยสารติดตามการปรับเวลาทำการบินของเที่ยวบินต่างๆ ได้จากเว็บไซต์ thaiairways.com หรือ THAI Contact Center โทร. 0-2356-1111 หรือ ตัวแทนจำหน่ายบัตรโดยสารของการบินไทยส่วนในไทย เมื่อเวลา 14.00 น. วันเดียวกัน ที่กองกำกับการ 1 กองบังคับการตำรวจท่องเที่ยว 1 กองบัญชาการตำรวจท่องเที่ยว (กก.1 บก.ทท.1 บช.ทท.) พล.ต.ท.ดำรงศักดิ์ กิตติประภัสต์ ผู้ช่วย ผบ.ตร. กล่าวถึงการรับมือนักท่องเที่ยวหรือผู้โดยสารที่อาจตกค้างในสนามบินจากเหตุไต้ฝุ่นฮากิบิส ที่ได้พัดเข้าฝั่งประเทศญี่ปุ่นระหว่างวันที่ 12-13 ต.ค.นี้ว่า ขณะนี้ยังไม่ได้รับรายงานเข้ามาว่ามีผู้โดยสารตกค้างเป็นอย่างไรบ้าง แต่ได้ประสานกับหน่วยงานที่เกี่ยวข้อง ทั้งกระทรวงการต่างประเทศ ตำรวจท่องเที่ยวเพื่อวางแผนรับมือ และหากมีผู้โดยสารที่มีเที่ยวบินไปประเทศญี่ปุ่นแต่เที่ยวบินถูกเลื่อนออกไป จนทำให้ต้องพักอยู่ในสนามบิน โดยจะจัดหาน้ำ อาหารและที่พักรองรับ พร้อมทั้งติดตามกลุ่มที่อยู่นอกพื้นที่สนามบินอย่างใกล้ชิดด้วยเช่นกัน"
print(FrequencySummarizer.summarize_text(text, 5))